# 1) შექმენით სია რომელშიც მოათავსებთ 15 ელემენტს შემდეგ ამ სიიდან დაბეჭდავთ შუაში მყოფ სამ ელემენტს შემდეგ, დაბეჭდავთ 2 ინდექსიდან 7 ინდექსამდე ელემენტებს, დაბეჭდავთ თავიდან 7 ინდექსამდე ელემენტებს, დაბეჭდავთ 7 ინდექსიდან ბოლომდე ელეენტებს

# list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

# print(list1[int(len(list1) / 2 - 1):int(len(list1) / 2 + 2)])
# print(list1[2::7])
# print(list1[:7])
# print(list1[7::])

# 2) შექმენით სია სადაც იქნება 10 სახელი შემდეგ ამ სიიდან ამოშლით ყველა იმ სახელს რომელიც იწყება ა ასოზე და დაბეჭდეთ გაფილტრული სია

list2 = ["Gio", "Aleqsandre", "Saba", "Ana", "Nika", "Andria"]

for i in list2:
    if i.lower()[0] == "a":
        list2.remove(i)
print(list2)