# რაში გამოიყენება კომენტარი? - კომენტარი გადასცემს კოდის საჭირო ინფორმაციას მხოლოდ ადამიანებს. ასევე გამოიყენება რომ გავთიშოთ კოდი დროებით (როდესაც გვგონია რომ კოდში იწვევს პრობლემებს)

# Declaring - რაღაცის შექმნა/დეკლარაცია.

# Case Sensitive Language - ითარგმნება როგორც ქეის სენსიტიური ენა, დიდი და პატარა ასოები ძალიან განსხვავდებიან ერთმანეთისგან.

Print   # არასწორე
print   # სწორე

credit = 100
Credit = 200
CREDIt = 300

# uppercase - დიდი ასო
# lowercase - პატარა ასო

# underscore "_" - ქვედა ტირე

# snake case - space-ების მაგივრად გამოიყენება underscore

dog_name = "Mura"

# camel case - ყოველი სიტყვას პირველი ასო uppercase არის

DogName = "Jeka"

print(dog_name)


